"""Решение задачи 1 - "Случайный массив"""

"""
Задание: 
Сформировать и заполнить массив случайным числами и вывести максимальное,
минимальное и среднее значение.
Для генерации случайного числа использовать метод `Math.random()`, который возвращает
значение в промежутке [0, 1].

Описание решения задачи:
Для решения создадим 2 функции: 
random_array для создания массива случайных элементов от 0 до 1, 
max_min_mean - для нахождения максимального, минимального и среднего значения.
"""


def random_array() -> list[int]:
    """Создание массива случайных элементов от 0 до 1"""
    output: list[int] = list()
    return output


def max_min_mean() -> dict[str, float]:
    """Нахождение максимального, минимального и среднего значения"""
    output: dict[str, float] = dict()
    return output
